#!usr/bin/env python3

# Пользователь вводит с клавиатуры числа, до тех пор, пока не введет
# число 0. На основе введенных данных нужно сформировать список, состоящий
# из квадратов введенных чисел.
print('Задача 1:')


# Написать программу удаления из списка всех номеров с кодом «+7».
# test_list =  ['+7912123456', '+7915213456', '+6915213456', '+4915213456',
# '+7915213456']
print('Задача 2:')

# Написать программу циклического сдвига элементов списка влево. Например, дан список:[1,2,3,4,5,6]
# после сдвига на один элемент влево, должны получить: [2,3,4,5,6,1]
# Реализовать через цикл, перебирая все элементы.
print('Задача 3:')


# Написать аналогичную программу циклического сдвига, но теперь вправо.
print('Задача 4:')

